app/controllers/api/v1/scores_controller.rb

SELECT "scores".* FROM "scores"
---
  def index
    @scores = Score.all

INSERT INTO "scores" ("title", "composer", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdas"], ["composer", "asdasd"], ["user_id", 1], ["created_at", "2018-08-08 12:52:02.855493"], ["updated_at", "2018-08-08 12:52:02.855493"]]
---
  def create
    @score = Score.create(score_params)

SELECT  "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @score = Score.find(params[:id])

SELECT  "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "scores" WHERE "scores"."id" = $1  [["id", 2]]
SELECT "scores".* FROM "scores"
---
  def destroy
    @score = Score.find(params[:id])
    @score.destroy
    render json: Score.all