app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: params["username"])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "davidt"], ["LIMIT", 1]]